tests/integration/test_C2SM/foam_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application    flameletCloudFoam;

startFrom      startTime;//latestTime;//

startTime       0.0;

stopAt          endTime;//writeNow;//

endTime         0.06;

deltaT          5e-6;

writeControl    adjustableRunTime;

writeInterval   0.002;

purgeWrite      1;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.8;

maxDeltaT       1e-5;

deleteParticles false;


clouds
{ 
        carbCloud      carbonaceousCloud;

}

libs    (	"libreactionThermophysicalModelsSTFS.so"
			"libgroovyBC.so" );

// ************************************************************************* //
functions
{
    writeCarbCloud
    {
        type            vtkCloud;
        libs            (lagrangianFunctionObjects);
        writeControl    adjustableRunTime;
        writeInterval   1e-4;
        format          ascii;
        cloud           carbCloud;
        fields          ( T origId d "Y.*" );
    }
    sumZ
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    timeStep;
	writeInterval	1;
        log             yes;
        writeFields     no;
        regionType      patch;
        name            OUTLET;
        operation       weightedSum;
        weightField     phi;

        fields
        (
            Z
        );
    }

}
