tests/integration/test_C2SM/foam_template/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar;

RAS
{
    RASModel        kEpsilon;

    turbulence      on;

    printCoeffs     yes;
}
LES
{
    turbulence      on;
    LESModel        WALE;
    
    delta           cubeRootVol;

    cubeRootVolCoeffs
    {
        // Optional entries

        // Multiplier
        deltaCoeff      1;
    }

}

// ************************************************************************* //
