tests/integration/test_C2SM/foam_template/0.org/ha
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0.3";
    object      ha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 537129;

boundaryField
{
    WALL
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    INLET
    {
        type            fixedValue;
        value           uniform 537129;
    }
}


// ************************************************************************* //
